app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date
---
  def index
    @all_ratings= Movie.all_ratings
    @ratings=Hash[@all_ratings.map { |e| [e, 1] }]